Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.CombinedDimensionAttributes Constructor (Int32, DimensionSetBaseAttributes.CombineFormats)
 Creates a new combined dimension attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CombinedDimensionAttributes(
	int minimumNumberToCombine,
	DimensionSetBaseAttributes.CombineFormats format
)
Public Sub New (
	minimumNumberToCombine As Integer,
	format As DimensionSetBaseAttributes.CombineFormats
)
Parameters
minimumNumberToCombine
Type: System.Int32
The minimum number of dimensions to be combined.
format
Type: Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombineFormats
The format of the combined dimensions.
See Also
Reference
DimensionSetBaseAttributes.CombinedDimensionAttributes Class
DimensionSetBaseAttributes.CombinedDimensionAttributes Overload
Tekla.Structures.Drawing Namespace